%%--spot_width-----
%%--李先鹏----------
%%--20190409--------
%%-------------------------------------------------------------------
%根据光束宽度的光强二阶矩定义计算光斑两个正交方向的宽度
%输入光斑图像的灰度值矩阵，数值类型‘double’，输出两个正交方向的光束宽度。
%%-------------------------------------------------------------------
function [width]=spot_width(a)
[x,y]=size(a);
deta1_x=0;
detal_y=0;
deta2_x=0;
deta2_y=0;
d_x=0;
d_y=0;
P=0;
E1_x=0;
E1_y=0;
E2_x=0;
E2_y=0;
%--计算x方向一阶矩---------------
for i=1:y
    for j=1:x
        P=P+a(j,i);
        E1_x=E1_x+j*a(j,i);
    end
end
    deta1_x=E1_x/P;
%--------------------------------- 

%--计算y方向一阶矩---------------
for i=1:x
    for j=1:y
        E1_y=E1_y+j*a(i,j);
    end
end
    deta1_y=E1_y/P;
%--------------------------------- 

%--计算x方向二阶矩-----------------    
for i=1:y
    for j=1:x
        E2_x=E2_x+a(j,i)*(j-deta1_x)^2;
    end
end
%-----------------------------------

%--计算y方向二阶矩-----------------    
for i=1:x
    for j=1:y
        E2_y=E2_y+a(i,j)*(j-deta1_y)^2;
    end
end
%-----------------------------------

%--计算x方向光束宽度-----------------
    deta2_x=E2_x/P;
    d_x=4*sqrt(deta2_x);
%----------------------------------
%--计算y方向光束宽度
    deta2_y=E2_y/P;
    d_y=4*sqrt(deta2_y); 
%-----------------------------------
width=[d_x,d_y];
end





